{
  "projects": [
    {
      "name": {
        "en": "Nine Men's Morris Game",
        "es": "Juego del Molino"
      },
      "description": {
        "en": "A C++ console game designed to reinforce control structures, modular programming, and array manipulation in an algorithmic setting.",
        "es": "Juego de consola en C++ diseñado para reforzar estructuras de control, programación modular y manipulación de arreglos en un entorno algorítmico."
      },
      "date": {
        "en": "April 2022 - June 2022",
        "es": "Abril 2022 - Junio 2022"
      },
      "link": "https://github.com/PieroD04/Nine-Mens-Morris",
      "image": "ninemenmorris.jpg",
      "icon": "pi pi-play"
    },
    {
      "name": {
        "en": "Dijkstra Shortest Path",
        "es": "Camino más corto de Dijkstra"
      },
      "description": {
        "en": "Python program that finds the shortest path between two nodes in a graph using Dijkstra's algorithm. Developed for the Computer Mathematics course.",
        "es": "Programa en Python que encuentra el camino más corto entre dos nodos en un grafo utilizando el algoritmo de Dijkstra. Desarrollado para el curso de Matemática Computacional."
      },
      "date": {
        "en": "August 2023 - September 2023",
        "es": "Agosto 2023 - Septiembre 2023"
      },
      "link": "https://github.com/salvadoorssalinas/MateComputacional",
      "image": "dijkstra.jpg",
      "icon": "pi pi-angle-double-right"
    },
    {
      "name": {
        "en": "Music Connection",
        "es": "Music Connection"
      },
      "description": {
        "en": "Landing page to show an app that connects musicians with bands and vice versa. Developed for the HCI and Mobile Technologies course.",
        "es": "Página de presentación (Landing Page) para mostrar una aplicación que conecta músicos con bandas y viceversa. Desarrollado para el curso de IHC y Tecnologías Móviles."
      },
      "date": {
        "en": "September 2023 - November 2023",
        "es": "Septiembre 2023 - Noviembre 2023"
      },
      "link": "https://github.com/salvadoorssalinas/MusicConnection",
      "image": "musicconnection.png",
      "icon": "pi pi-link"
    },
    {
      "name": {
        "en": "Optimization of Internet Fiber Optic Networks",
        "es": "Optimización de Redes de Fibra Óptica de Internet"
      },
      "description": {
        "en": "Python program that analyzes the best route for fiber optic networks to minimize costs and maximize efficiency, using graph analysis and two different algorithms. Developed for the Algorithmic Complexity course.",
        "es": "Programa en Python que analiza la mejor ruta para redes de fibra óptica para minimizar costos y maximizar eficiencia, utilizando análisis de grafos y dos algoritmos diferentes. Desarrollado para el curso de Complejidad Algorítmica."
      },
      "date": {
        "en": "September 2023 - November 2023",
        "es": "Septiembre 2023 - Noviembre 2023"
      },
      "link": "https://github.com/jsyumg/TB-ComplejidadAlgoritmica",
      "image": "switchs.png",
      "icon": "pi pi-sitemap"
    },
    {
      "name": {
        "en": "CargoApp",
        "es": "CargoApp"
      },
      "description": {
        "en": "Web application that allows businesses to organise and track their shipments, as well as receiving notifications about their status. Developed using Vue.js and .NET.",
        "es": "Aplicación web que permite a las empresas organizar y rastrear sus envíos, así como recibir notificaciones sobre su estado. Desarrollado con Vue.js y .NET."
      },
      "date": {
        "en": "April 2024 - June 2024",
        "es": "Abril 2024 - Junio 2024"
      },
      "link": "https://github.com/PieroD04/cargoapp",
      "image": "cargoapp.png",
      "icon": "pi pi-desktop"
    },
    {
      "name": {
        "en": "AgroConnect",
        "es": "AgroConnect"
      },
      "description": {
        "en": "Web application for managing resources and expenses for guinea pigs farms, apart from helping farmers connect with experienced advisors to help them. Developed using Angular and Spring Boot.",
        "es": "Aplicación web para gestionar recursos y gastos de granjas de cuyes, además de ayudar a los agricultores a conectarse con asesores experimentados para ayudarlos. Desarrollado con Angular y Spring Boot."
      },
      "date": {
        "en": "April 2024 - June 2024",
        "es": "Abril 2024 - Junio 2024"
      },
      "link": "https://github.com/PieroD04/agroconnect",
      "image": "agroconnect.png",
      "icon": "pi pi-desktop"
    },
    {
      "name": {
        "en": "AgroSupport",
        "es": "AgroSupport"
      },
      "description": {
        "en": "Mobile application that allows farmers to schedule appointments to receive help from experts. Developed using Kotlin with Jetpack Compose and Spring Boot.",
        "es": "Aplicación móvil que permite a los agricultores programar citas para recibir ayuda de expertos. Desarrollado con Kotlin con Jetpack Compose y Spring Boot."
      },
      "date": {
        "en": "August 2024 - November 2024",
        "es": "Agosto 2024 - Noviembre 2024"
      },
      "link": "https://github.com/PieroD04/agrosupport",
      "image": "agrosupport.png",
      "icon": "pi pi-mobile"
    }
  ]
}